Дипломная_работа/src/Documents/BKM_ОбслуживаниеКлиента/BKM_ОбслуживаниеКлиента.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>BKM_ОбслуживаниеКлиента</name>
  <registerRecords>AccumulationRegister.BKM_ВыполненныеКлиентуРаботы</registerRecords>
  <attributes>
    <name>BKM_Клиент</name>
    <type>
      <types>CatalogRef.ВКМ_Клиенты</types>
    </type>
  </attributes>
  <attributes>
    <name>BKM_Договор</name>
    <type>
      <types>CatalogRef.УДАЛИТЬ_ДоговорыКонтрагентов</types>
    </type>
  </attributes>
  <attributes>
    <name>BKM_Специалист</name>
    <type>
      <types>CatalogRef.ВКМ_Сотрудники</types>
    </type>
  </attributes>
  <attributes>
    <name>BKM_ДатаРабот</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>BKM_ВремяНачалаПлан</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>BKM_ВремяОкончанияПлан</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>BKM_ОписаниеПроблемы</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>BKM_Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <tabularSections>
    <name>BKM_ВыполненныеРаботы</name>
    <attributes>
      <name>BKM_ОписаниеРабот</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
    <attributes>
      <name>BKM_ФактЧасы</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>BKM_ЧасыКОплате</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

Дипломная_работа/src/AccumulationRegisters/BKM_ВыполненныеСотрудникомРаботы/BKM_ВыполненныеСотрудникомРаботы.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:AccumulationRegister>
  <name>BKM_ВыполненныеСотрудникомРаботы</name>
  <registerType>Turnovers</registerType>
  <resources>
    <name>BKM_ЧасовКОплате</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>BKM_СуммаКОплате</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>BKM_Сотрудник</name>
    <type>
      <types>CatalogRef.ВКМ_Сотрудники</types>
    </type>
  </dimensions>
</mdclass:AccumulationRegister>

Дипломная_работа/src/InformationRegisters/BKM_УсловияОплатыСотрудников/BKM_УсловияОплатыСотрудников.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>BKM_УсловияОплатыСотрудников</name>
  <informationRegisterPeriodicity>Month</informationRegisterPeriodicity>
  <resources>
    <name>BKM_Оклад</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>BKM_ПроцентОтРабот</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>BKM_Сотрудник</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>10</length>
      </stringQualifiers>
    </type>
  </dimensions>
</mdclass:InformationRegister>

Дипломная_работа/src/Documents/BKM_ОбслуживаниеКлиента/ObjectModule.bsl
#Область ОбработчикиСобытий

// НОВОЕ: Процедура для выполнения первого замечания (сравнение с БД)
Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)
	
	// Если документ новый — сравнивать не с чем, выходим
	Если ЭтоНовый() Или ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;

	// 1. Получаем текущие (старые) значения из базы данных ЗАПРОСОМ
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	Док.BKM_Специалист КАК Специалист,
		|	Док.BKM_Договор КАК Договор
		|ИЗ
		|	Документ.ОбслуживаниеКлиента КАК Док
		|ГДЕ
		|	Док.Ссылка = &Ссылка";
	
	Запрос.УстановитьПараметр("Ссылка", Ссылка);
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Если Выборка.Следующий() Тогда
		
		// 2. Сравниваем значения в памяти (ЭтотОбъект) со значениями из БД (Выборка)
		Если Выборка.Специалист <> BKM_Специалист Тогда
			// Здесь можно добавить логику, если специалист изменился
			// Например: Сообщить("Специалист был изменен!");
		КонецЕсли;
		
		Если Выборка.Договор <> BKM_Договор Тогда
			// Логика при изменении договора
		КонецЕсли;
		
	КонецЕсли;

КонецПроцедуры

Процедура ОбработкаПроведения(Отказ, РежимПроведения)

	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;

	Если BKM_Специалист = Неопределено Тогда
		ВызватьИсключение "Не указан специалист.";
	КонецЕсли;

	Если BKM_Договор = Неопределено Тогда
		ВызватьИсключение "Не указан договор.";
	КонецЕсли;

	Процент = ПолучитьПроцентОплаты(НачалоМесяца(Дата), BKM_Специалист);

	Если Процент = Неопределено Или Процент <= 0 Тогда
		ВызватьИсключение "Не установлены условия оплаты (процент от работ) на месяц документа.";
	КонецЕсли;

	ЧасыКОплатеКлиенту = 0;
	Для каждого Стр Из BKM_ВыполненныеРаботы Цикл
		ЧасыКОплатеКлиенту = ЧасыКОплатеКлиенту + Стр.BKM_ЧасыКОплате;
	КонецЦикла;

	// Используем обновленную функцию
	СтавкаЧасаКлиента = ПолучитьСтоимостьЧасаДоговора(BKM_Договор);

	Если СтавкаЧасаКлиента = Неопределено Или СтавкаЧасаКлиента <= 0 Тогда
		ВызватьИсключение "В договоре не указана стоимость часа.";
	КонецЕсли;

	СуммаКОплатеСотруднику = Окр(ЧасыКОплатеКлиенту * СтавкаЧасаКлиента * Процент / 100, 2);

	Движения.BKM_ВыполненныеСотрудникомРаботы.Записывать = Истина;
	Движение = Движения.BKM_ВыполненныеСотрудникомРаботы.Добавить();
	Движение.Период = Дата;
	Движение.BKM_Сотрудник = BKM_Специалист;
	Движение.BKM_ЧасовКОплате = ЧасыКОплатеКлиенту;
	Движение.BKM_СуммаКОплате = СуммаКОплатеСотруднику;

КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Функция ПолучитьПроцентОплаты(Период, Сотрудник) Экспорт

	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ ПЕРВЫЕ 1
	|	Условия.BKM_ПроцентОтРабот КАК Процент
	|ИЗ
	|	РегистрСведений.BKM_УсловияОплатыСотрудников КАК Условия
	|ГДЕ
	|	Условия.BKM_Сотрудник = &Сотрудник
	|	И Условия.Период <= &Период
	|УПОРЯДОЧИТЬ ПО
	|	Условия.Период УБЫВ";

	Запрос.УстановитьПараметр("Сотрудник", Сотрудник);
	Запрос.УстановитьПараметр("Период", Период);

	Выборка = Запрос.Выполнить().Выбрать();
	Если Выборка.Следующий() Тогда
		Возврат Выборка.Процент;
	КонецЕсли;

	Возврат Неопределено;

КонецФункции

Функция ПолучитьСтоимостьЧасаДоговора(ДоговорСсылка) Экспорт

	// ИСПРАВЛЕНО: Теперь используется имя нового справочника ДоговорыКонтрагентов
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	Договор.СтоимостьЧаса КАК СтоимостьЧаса
	|ИЗ
	|	Справочник.ДоговорыКонтрагентов КАК Договор
	|ГДЕ
	|	Договор.Ссылка = &Ссылка";

	Запрос.УстановитьПараметр("Ссылка", ДоговорСсылка);

	Выборка = Запрос.Выполнить().Выбрать();
	Если Выборка.Следующий() Тогда
		Возврат Выборка.СтоимостьЧаса;
	КонецЕсли;

	Возврат Неопределено;

КонецФункции

#КонецОбласти
